{
    "phase": "Phase 2 Iteration 2: Enhanced Agents & Knowledge Graph",
    "phase_goal": "Significantly enhance core AI agents (Test Generation, Code Review) with deeper code understanding and integrate them with an expanded Knowledge Graph for improved context management and generation quality.",
    "success_metrics": [
        "Enhanced TestGenerationAgent generates meaningful tests (e.g., basic unit tests) based on code structure/purpose.",
        "Enhanced CodeReviewAgent performs semantic analysis (beyond static linting) and identifies logical issues.",
        "Knowledge Graph schema supports storing AST, control flow, and data flow information.",
        "Agents can effectively query the KG to retrieve relevant code context and relationships.",
        "WorkflowDriver successfully orchestrates enhanced agents using KG context.",
        "Basic AI-driven debugging/refactoring agent placeholder is functional.",
        "Comprehensive tests for Phase 2 Iteration 2 features achieve >= 90% code coverage."
    ],
    "tasks": [
        {
            "task_id": "task_2_2a",
            "priority": "High",
            "task_name": "Enhance TestGenerationAgent for Semantic Understanding",
            "description": "Modify TestGenerationAgent to use AST analysis and potentially LLM calls to understand code structure and purpose, generating basic, meaningful unit tests instead of placeholders. (Est. Time: 3-5 days)",
            "status": "Not Started"
        },
        {
            "task_id": "task_2_2b",
            "priority": "High",
            "task_name": "Enhance CodeReviewAgent with Semantic Analysis",
            "description": "Add capabilities to CodeReviewAgent to perform basic semantic code analysis (e.g., simple dead code detection, potential logic errors) using AST or LLMs, beyond current static analysis. (Est. Time: 3-5 days)",
            "status": "Not Started"
        },
        {
            "task_id": "task_2_2c",
            "priority": "Critical",
            "task_name": "Expand Knowledge Graph Schema for Code Semantics",
            "description": "Define and implement the KG schema to store richer code semantics including AST nodes, control flow, and data flow relationships. Update KG utility methods to support this. (Est. Time: 4-6 days)",
            "status": "Not Started"
        },
        {
            "task_id": "task_2_2d",
            "priority": "High",
            "task_name": "Implement KG Query Methods for Agent Context",
            "description": "Add specific query methods to the Knowledge Graph interface that agents can use to retrieve relevant code context, such as finding related functions, class definitions, or dependencies for a given code snippet. (Est. Time: 2-3 days)",
            "status": "Not Started"
        },
        {
            "task_id": "task_2_2e",
            "priority": "Critical",
            "task_name": "Integrate Enhanced Agents with WorkflowDriver & KG",
            "description": "Modify the WorkflowDriver to orchestrate the enhanced TestGenerationAgent and CodeReviewAgent, enabling them to query and utilize the expanded Knowledge Graph for context during their execution. (Est. Time: 3-4 days)",
            "status": "Not Started"
        },
         {
            "task_id": "task_2_2f",
            "priority": "Medium",
            "task_name": "Implement Basic AI-Driven Debugging/Refactoring Agent Placeholder",
            "description": "Create a new agent (e.g., DebugRefactorAgent) with placeholder logic for AI-driven debugging suggestions or simple refactoring tasks, laying the groundwork for future enhancements. (Est. Time: 2-3 days)",
            "status": "Not Started"
        },
        {
            "task_id": "task_2_2g",
            "priority": "High",
            "task_name": "Add Comprehensive Tests for Phase 2 Iteration 2",
            "description": "Write comprehensive unit and integration tests covering the enhanced agents, expanded KG schema, KG query methods, and their integration with the WorkflowDriver. Aim for >= 90% code coverage for new logic. (Est. Time: 4-6 days)",
            "status": "Not Started"
        }
    ],
    "next_phase_actions": [
         "Set `status`: `Completed` on all Phase 2 Iteration 2 tasks",
         "Remove all Phase 2 Iteration 2 tasks from the json config",
         "Set 🎯 CURRENT FOCUS to `Phase 2 Iteration 3: Ethical Governance & API Expansion`",
         "Add tasks from Iteration 3 (Ethical Governance & API Expansion)"
    ],
    "current_focus": "🎯 CURRENT FOCUS: Phase 2 Iteration 2 - Enhanced Agents & Knowledge Graph 🧠"
}